{
  "menu": {
    "about": "About me",
    "technologies": "Technologies",
    "experience": "Experience",
    "projects": "Projects"
  },
  "about": {
    "summary": "Backend software developer with 2+ years of freelance experience and 1.5 years certified in building and maintaining robust and scalable applications. Skilled in implementing APIs and web services using Java, PHP, and JavaScript, with a focus on performance and security optimization. Proactive, with a strong ability to solve complex problems and work in a team to achieve innovative solutions.",
    "time": "+4 years as a developer",
    "projects": "+7 projects",
    "home": "I live in Bogotá D.C. Colombia",
    "contact": "mateoromero0910@gmail.com"
  },

  "technologies": {
    "title": "Technologies",
    "technologies": [
      {
        "name": "PHP",
        "level": "Advanced",
        "image": "images/php.webp"
      },
      {
        "name": "JavaScript",
        "level": "Advanced",
        "image": "images/js.webp"
      },
      {
        "name": "HTML 5",
        "level": "Expert",
        "image": "images/html.webp"
      },
      {
        "name": "CSS 3",
        "level": "Essential",
        "image": "images/css.webp"
      },
      {
        "name": "Laravel",
        "level": "Expert",
        "image": "images/laravel.webp"
      },
      {
        "name": "Angular",
        "level": "Essential",
        "image": "images/angular.webp"
      },
      {
        "name": "Java",
        "level": "Intermediate",
        "image": "images/java.webp"
      },
      {
        "name": "Spring Boot",
        "level": "Essential",
        "image": "images/springBoot.webp"
      },
      {
        "name": "Docker",
        "level": "Advanced",
        "image": "images/docker.webp"
      },
      {
        "name": "Git",
        "level": "Advanced",
        "image": "images/git.webp"
      },
      {
        "name": "GitHub",
        "level": "Advanced",
        "image": "images/github.webp"
      },
      {
        "name": "Kubernetes",
        "level": "Essential",
        "image": "images/kubernetes.webp"
      },
      {
        "name": "SQL",
        "level": "Advanced",
        "image": "images/sql.webp"
      },
      {
        "name": "EC2 AWS",
        "level": "Essential",
        "image": "images/ec2.webp"
      },
      {
        "name": "RDS",
        "level": "Essential",
        "image": "images/rds.webp"
      },
      {
        "name": "S3",
        "level": "Essential",
        "image": "images/s3.webp"
      },
      {
        "name": "Python",
        "level": "Essential",
        "image": "images/python.webp"
      }
    ]
  },

  "Experience": {
    "title": "Experience",
    "jobs": [
      {
        "company": "Servicio Nacional de Aprendizaje (SENA)",
        "position": "Backend Developer",
        "duration": "January 2023 - December 2023",
        "description": "I led the development and maintenance of a visit scheduling system with Laravel, implementing new functionalities and optimizing system performance, which improved operational efficiency by 40%. Coordinated tasks and client requirements in regular meetings and used Git and GitHub for version control and collaboration, facilitating an agile and orderly workflow."
      },

      {
        "company": "Montechelo Tecnology",
        "position": "Backend Developer",
        "duration": "January 2024 - July 2024",
        "description": "I implemented critical functionalities in backend applications, improving performance by 30%, and contributed to frontend development with Angular, improving usability by 25%. Explored and evaluated the viability of microservices for future iterations and worked collaboratively with cross-functional teams to ensure development cohesion and efficiency, using Git and GitHub for version control and collaboration."
      }
    ]
  },
  "Projects": {
    "title": "Projects",
    "projects": [
      {
        "technologies":"Java, Spring Boot, AWS, JWT, MySql",
        "title": "managementProjects",
        "description": "It is a comprehensive platform designed for project management. Its main features include task assignment, user management, email sending, route protection, and authentication via JWT (JSON Web Token). Technologies such as Java and Spring Boot were used for the development of the backend service, ensuring a robust and scalable architecture. Additionally, a connection was established with cloud services from AWS (Amazon Web Services), providing a flexible and secure infrastructure for the deployment and operation of the application.",
        "projectUrl": "https://github.com/juanmac09/managementProjects"
      },

      {
        "technologies":"PHP, Laravel, Laravel Excel, Autenticación,MySql",
        "title": "Export and import Excel",
        "description": "This project allows you to successfully import data from an Excel file and load it into a relational database. It also allows you to export data from the database to an Excel file. Developed with PHP and Laravel, includes queue management in Laravel to improve performance.",
        "projectUrl": "https://github.com/juanmac09/Export-Import_Excel"
      },
      {
        "technologies":"PHP, Laravel, Laravel Excel, JWT, MQTT, MySql",
        "title": "Real-time chat - Backend",
        "description": "This project includes the development of the backend using Laravel for the creation of REST API services. It implements the MQTT messaging protocol for real-time actions, uses middleware for route protection and uses JWT tokens to guarantee the security of the application. In addition, manage users, message reports, groups and scheduled tasks.",
        "projectUrl": "https://github.com/juanmac09/chat"
      },
      {
        "technologies":"TypeScript, Angular, Angular Chart, JWT, MQTT, RxJS",
        "title": "Real-time chat - Frontend",
        "description": "This project covers the development of the frontend for a real-time chat application, using Angular. It uses reactive programming to update values ​​in real time and message animations to optimize the user experience. Additionally, it integrates backend services to make requests to the server efficiently.",
        "projectUrl": "https://github.com/sebastiansegura2000/Chat-view"
      },
      {
        "technologies":"PHP, Laravel, AWS, JWT, Redis",
        "title": "Online Courses",
        "description": "This project, developed with Laravel, offers a complete platform for managing online courses. It includes functionalities for course and enrollment management, user and role administration, and sending email notifications. It uses Redis for cache and queue management, and Amazon S3 for static file storage. It also implements route protection and authorization mechanisms to ensure system security and privacy.",
        "projectUrl": "https://github.com/juanmac09/online-course"
      },
      {
        "technologies":"Java, Spring Boot, MySql",
        "title": "Backend User Management",
        "description": "This project develops a user management system through CRUD using Java and Spring Boot. It allows complete user creation, reading, updating and deleting operations, with direct and efficient interaction with the database.",
        "projectUrl": "https://github.com/juanmac09/technical-test"
      },
      {
        "technologies":"PHP,JavaScript, Html, Css, MySql",
        "title": "SastriApp",
        "description": "SastriApp is a web application developed with native PHP, CSS and HTML technologies. It is designed to manage inventories, users, products, suppliers and orders, specifically aimed at tailoring shops.",
        "projectUrl": "https://github.com/juanmac09/SastriApp"
      }
    ],
    "textButton": "View code",
    "technologyTitle": "Technologies: "
  },
  "footer": {
    "title": "All rights reserved."
  }
}
