{
  "menu": {
    "about": "Sobre mí",
    "technologies": "Tecnologías",
    "experience": "Experiencia",
    "projects": "Proyectos"
  },
  "about": {
    "summary": "Desarrollador de software Backend con más de 2 años como freelance y 1.5 años certificados en la creación y mantenimiento de aplicaciones robustas y escalables. Hábil en la implementación de Apis y servicios web utilizando Java, PHP y JavaScript, con un enfoque en la optimización del rendimiento y la seguridad. Proactivo, con una fuerte capacidad para resolver problemas complejos y trabajar en equipo para lograr soluciones innovadoras.",
    "time": "+4 años como desarrollador",
    "projects": "+7 proyectos",
    "home": "Vivo en Bogotá D.C. Colombia",
    "contact": "mateoromero0910@gmail.com"
  },

  "technologies": {
    "title": "Tecnologías",
    "technologies": [
      {
        "name": "PHP",
        "level": "Avanzado",
        "image": "images/php.webp"
      },
      {
        "name": "JavaScript",
        "level": "Avanzado",
        "image": "images/js.webp"
      },
      {
        "name": "HTML 5",
        "level": "Experto",
        "image": "images/html.webp"
      },
      {
        "name": "CSS 3",
        "level": "Básico",
        "image": "images/css.webp"
      },
      {
        "name": "Laravel",
        "level": "Experto",
        "image": "images/laravel.webp"
      },
      {
        "name": "Angular",
        "level": "Básico",
        "image": "images/angular.webp"
      },
      {
        "name": "Java",
        "level": "Intermedio",
        "image": "images/java.webp"
      },
      {
        "name": "Spring Boot",
        "level": "Básico",
        "image": "images/springBoot.webp"
      },
      {
        "name": "Docker",
        "level": "Avanzado",
        "image": "images/docker.webp"
      },
      {
        "name": "Git",
        "level": "Avanzado",
        "image": "images/git.webp"
      },
      {
        "name": "GitHub",
        "level": "Avanzado",
        "image": "images/github.webp"
      },
      {
        "name": "Kubernetes",
        "level": "Básico",
        "image": "images/kubernetes.webp"
      },
      {
        "name": "SQL",
        "level": "Avanzado",
        "image": "images/sql.webp"
      },
      {
        "name": "EC2 AWS",
        "level": "Básico",
        "image": "images/ec2.webp"
      },
      {
        "name": "RDS",
        "level": "Básico",
        "image": "images/rds.webp"
      },
      {
        "name": "S3",
        "level": "Básico",
        "image": "images/s3.webp"
      },
      {
        "name": "Python",
        "level": "Básico",
        "image": "images/python.webp"
      }
    ]
  },

  "Experience": {
    "title": "Experiencia",
    "jobs": [
      {
        "company": "Servicio Nacional de Aprendizaje (SENA)",
        "position": "Desarrollador Backend",
        "duration": "Enero 2023 - Diciembre 2023",
        "description": "Lideré el desarrollo y mantenimiento de un sistema de agendamiento de visitas con Laravel, implementando nuevas funcionalidades y optimizando el rendimiento del sistema, lo que mejoró la eficiencia operativa en un 40%. Coordiné tareas y requisitos del cliente en reuniones regulares y utilicé Git y GitHub para el control de versiones y la colaboración, facilitando un flujo de trabajo ágil y ordenado."
      },

      {
        "company": "Montechelo Tecnology",
        "position": "Desarrollador Backend",
        "duration": "Enero 2024 - Julio 2024",
        "description": "Implementé funcionalidades críticas en aplicaciones backend, mejorando el rendimiento en un 30%, y contribuí al desarrollo frontend con Angular, mejorando la usabilidad en un 25%. Exploré y evalué la viabilidad de microservicios para futuras iteraciones y trabajé en colaboración con equipos interdisciplinarios para asegurar la cohesión y eficiencia del desarrollo, utilizando Git y GitHub para el control de versiones y la colaboración."
      }
    ]
  },
  "Projects": {
    "title": "Proyectos",
    "projects": [
      {
        "technologies":"Java, Spring Boot, AWS, JWT, MySql",
        "title": "managementProjects",
        "description": "Es una plataforma integral diseñada para la gestión de proyectos. Sus funcionalidades principales incluyen la asignación de tareas, la gestión de usuarios, el envío de correos electrónicos, la protección de rutas y la autenticación mediante JWT (JSON Web Token). Para el desarrollo del servicio backend, se emplearon tecnologías como Java y Spring Boot, garantizando una arquitectura robusta y escalable. Además, se estableció la conexión con servicios en la nube de AWS (Amazon Web Services), lo que proporciona una infraestructura flexible y segura para el despliegue y operación de la aplicación. ",
        "projectUrl": "https://github.com/juanmac09/managementProjects"
      },
      {
        "technologies":"PHP, Laravel, Laravel Excel, Autenticación,MySql",
        "title": "Exportar e importar Excel",
        "description": "Este proyecto permite importar datos desde un archivo Excel y cargarlos a una base de datos relacional de manera exitosa. También permite exportar los datos desde la base de datos a un archivo Excel. Desarrollado con PHP y Laravel, incluye el manejo de colas en Laravel para mejorar el rendimiento.",
        "projectUrl": "https://github.com/juanmac09/Export-Import_Excel"
      },
      {
        "technologies":"PHP, Laravel, Laravel Excel, JWT, MQTT, MySql",
        "title": "Chat en tiempo real - Backend",
        "description": "Este proyecto incluye el desarrollo del backend utilizando Laravel para la creación de servicios API REST. Implementa el protocolo de mensajería MQTT para acciones en tiempo real, emplea middleware para la protección de rutas y utiliza tokens JWT para garantizar la seguridad del aplicativo. Además, gestiona usuarios, reportes de mensajes, grupos y tareas programadas.",
        "projectUrl": "https://github.com/juanmac09/chat"
      },
      {
        "technologies":"TypeScript, Angular, Angular Chart, JWT, MQTT, RxJS",
        "title": "Chat en Tiempo Real - Frontend",
        "description": "Este proyecto abarca el desarrollo del frontend para una aplicación de chat en tiempo real, utilizando Angular. Emplea programación reactiva para actualizar los valores en tiempo real y animaciones de mensajes para optimizar la experiencia del usuario. Además, integra los servicios backend para realizar solicitudes al servidor de manera eficiente.",
        "projectUrl": "https://github.com/sebastiansegura2000/Chat-view"
      },
      {
        "technologies":"PHP, Laravel, AWS, JWT, Redis",
        "title": "Cursos en Línea",
        "description": "Este proyecto, desarrollado con Laravel, ofrece una plataforma completa para la gestión de cursos en línea. Incluye funcionalidades para la gestión de cursos e inscripciones, administración de usuarios y roles, y envío de notificaciones por correo electrónico. Utiliza Redis para el manejo de caché y colas, y Amazon S3 para el almacenamiento de archivos estáticos. También implementa protección de rutas y mecanismos de autorización para garantizar la seguridad y privacidad del sistema.",
        "projectUrl": "https://github.com/juanmac09/online-course"
      },
      {
        "technologies":"Java, Spring Boot, MySql",
        "title": "Gestión de Usuarios Backend",
        "description": "Este proyecto desarrolla un sistema de gestión de usuarios mediante un CRUD utilizando Java y Spring Boot. Permite realizar operaciones completas de creación, lectura, actualización y eliminación de usuarios, con interacción directa y eficiente con la base de datos.",
        "projectUrl": "https://github.com/juanmac09/technical-test"
      },
      {
        "technologies":"PHP,JavaScript, Html, Css, MySql",
        "title": "SastriApp",
        "description": "SastriApp es una aplicación web desarrollada con tecnologías nativas de PHP, CSS y HTML. Está diseñada para gestionar inventarios, usuarios, productos, proveedores y pedidos, específicamente dirigida a sastrerías.",
        "projectUrl": "https://github.com/juanmac09/SastriApp"
      }
    ],
    "textButton": "Ver código",
    "technologyTitle": "Tecnologia: "
  },
  "footer": {
    "title": "Todos los derechos resevados."
  }
}
